public class Main {

    private static final String FILE = "Задача организации, в особенности же рамки и место обучения кадров требуют определения и уточнения систем массового участия. Товарищи! реализация намеченных плановых заданий способствует подготовки и реализации новых предложений.\n" +
            "\n" +
            "Не следует, однако забывать, что укрепление и развитие структуры требуют от нас анализа модели развития. Равным образом сложившаяся структура организации в значительной степени обуславливает создание систем массового участия. Не следует, однако забывать, что укрепление и развитие структуры влечет за собой процесс внедрения и модернизации направлений прогрессивного развития. Таким образом рамки и место обучения кадров играет важную роль в формировании новых предложений. Значимость этих проблем настолько очевидна, что укрепление и развитие структуры требуют определения и уточнения модели развития.\n" +
            "\n" +
            "Таким образом рамки и место обучения кадров в значительной степени обуславливает создание форм развития. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции влечет за собой процесс внедрения и модернизации форм развития. Равным образом реализация намеченных плановых заданий позволяет оценить значение форм развития. Задача организации, в особенности же консультация с широким активом представляет собой интересный эксперимент проверки модели развития. Разнообразный и богатый опыт укрепление и развитие структуры способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач.\n" +
            "\n" +
            "Задача организации, в особенности же постоянный количественный рост и сфера нашей активности влечет за собой процесс внедрения и модернизации существенных финансовых и административных условий. Разнообразный и богатый опыт укрепление и развитие структуры в значительной степени обуславливает создание систем массового участия. Идейные соображения высшего порядка, а также укрепление и развитие структуры позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям. Не следует, однако забывать, что начало повседневной работы по формированию позиции в значительной степени обуславливает создание систем массового участия. Равным образом рамки и место обучения кадров способствует подготовки и реализации дальнейших направлений развития. Не следует, однако забывать, что постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки существенных финансовых и административных условий.\n" +
            "\n" +
            "Не следует, однако забывать, что постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации дальнейших направлений развития. С другой стороны консультация с широким активом представляет собой интересный эксперимент проверки направлений прогрессивного развития. Повседневная практика показывает, что консультация с широким активом играет важную роль в формировании соответствующий условий активизации. Повседневная практика показывает, что дальнейшее развитие различных форм деятельности в значительной степени обуславливает создание форм развития. Не следует, однако забывать, что реализация намеченных плановых заданий играет важную роль в формировании соответствующий условий активизации.";

    public static void main(String[] args) {

        Util.countChars(FILE);
        Util.countWords(FILE);
        Util.reverseSentences(FILE);

    }
}
